config/constants.org
#+title: Constants Config
#+author: Pratik Abhyankar

* System Variables
Define system variables like OS name or Emacs version etc.
#+begin_src emacs-lisp
  (defconst NATIVECOMP (if (fboundp 'native-comp-available-p) (native-comp-available-p)))
  (defconst EMACS28+   (> emacs-major-version 27))
  (defconst EMACS29+   (> emacs-major-version 28))
  (defconst IS-MAC     (eq system-type 'darwin))
  (defconst IS-LINUX   (eq system-type 'gnu/linux))
  (defconst IS-WINDOWS (memq system-type '(cygwin windows-nt ms-dos)))
  (defconst IS-BSD     (or IS-MAC (eq system-type 'berkeley-unix)))
#+end_src

* Custom files and directories
#+begin_src elisp
	(defconst CUSTOM-DIR "custom/")
	(defconst CONFIG-DIR "config/")
	(defconst CUSTOM-FILE (expand-file-name (concat user-emacs-directory CUSTOM-DIR "custom-file.el")))
#+end_src
